---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarInstanceBarDiameter
source: html/a957347f-9e7e-483d-1bd8-a7bf4eee20ac.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarInstanceBarDiameter Property

"Bar Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarInstanceBarDiameter { get; }
```